In [1]:
print("Om Vakraduntaaya Namah")

Om Vakraduntaaya Namah

In [7]:
import numpy as np
import pandas as pd

In [15]:
df1_cars = pd.DataFrame({'name': ['lexus','ferrari','mercedez'],
        'color':['red','white','black'],
        'year':['2012','2014','2015'] },index = [0,1,2])
 # 
print (df1_cars)     
type(df1_cars)
df1_cars[['color','name','year']]

       name  color  year
0     lexus    red  2012
1   ferrari  white  2014
2  mercedez  black  2015

   color      name  year
0    red     lexus  2012
1  white   ferrari  2014
2  black  mercedez  2015

In [10]:
df2_cars = pd.DataFrame({'name': ['lexus','bmw','mercedez'],
        'color':['red','white','blue'],
        'year':['2013','2015','2016'] } ,index = [0,1,3] )

print (df2_cars)     
type(df2_cars)

       name  color  year
0     lexus    red  2013
1       bmw  white  2015
3  mercedez   blue  2016

pandas.core.frame.DataFrame

In [12]:
# combine the data frames row wise
concat_df = pd.concat([df1_cars,df2_cars],axis=0)

In [13]:
concat_df

       name  color  year
0     lexus    red  2012
1   ferrari  white  2014
2  mercedez  black  2015
0     lexus    red  2013
1       bmw  white  2015
3  mercedez   blue  2016

In [16]:
# combine the data frames row wise
col_df = pd.concat([df1_cars,df2_cars],axis=1)

In [17]:
col_df

       name  color  year      name  color  year
0     lexus    red  2012     lexus    red  2013
1   ferrari  white  2014       bmw  white  2015
2  mercedez  black  2015       NaN    NaN   NaN
3       NaN    NaN   NaN  mercedez   blue  2016

In [21]:
df_m = pd.merge(df1_cars,df2_cars,left_index=True,right_index=True)
df_m

    name_x color_x year_x name_y color_y year_y
0    lexus     red   2012  lexus     red   2013
1  ferrari   white   2014    bmw   white   2015

In [23]:
df_m = pd.merge(df1_cars,df2_cars,left_on='name',right_on='name')
df_m

       name color_x year_x color_y year_y
0     lexus     red   2012     red   2013
1  mercedez   black   2015    blue   2016

In [24]:
# if both df's joining column names are same.
df_subject = pd.DataFrame({'SectionId': ['Id1', 'Id2', 'Id3', 'Id4'],
                                'Subjects': ['Maths', 'Science', 'Computer', 'History'],
                                'Semester': ['First','Second','First','Third']
                               },index=[0, 1, 2,3])
df_students = pd.DataFrame({'ClassId': ['Id4', 'Id1', 'Id6', 'Id2'],
                               'Students': ['John', 'Trevor', 'David', 'Chris'],
                               },index=[4,5,6,7])
merge_frame= pd.merge(df_subject,df_students,how='inner',left_on='SectionId',right_on='ClassId')
print("\nMerged dataframe\n")
print (merge_frame)

Merged dataframe

  SectionId Subjects Semester ClassId Students
0       Id1    Maths    First     Id1   Trevor
1       Id2  Science   Second     Id2    Chris
2       Id4  History    Third     Id4     John

In [28]:
merge_frame= pd.merge(df_subject,df_students,how='left',left_on='SectionId',right_on='ClassId')
print("\nMerged dataframe\n")
print (merge_frame)

Merged dataframe

  SectionId  Subjects Semester ClassId Students
0       Id1     Maths    First     Id1   Trevor
1       Id2   Science   Second     Id2    Chris
2       Id3  Computer    First     NaN      NaN
3       Id4   History    Third     Id4     John

In [29]:
merge_frame= pd.merge(df_subject,df_students,how='outer',left_on='SectionId',right_on='ClassId')
print("\nMerged dataframe\n")
print (merge_frame)

Merged dataframe

  SectionId  Subjects Semester ClassId Students
0       Id1     Maths    First     Id1   Trevor
1       Id2   Science   Second     Id2    Chris
2       Id3  Computer    First     NaN      NaN
3       Id4   History    Third     Id4     John
4       NaN       NaN      NaN     Id6    David

In [30]:
join_frame= df_subject.join(df_students,lsuffix='_left' , rsuffix='_right')
print("\nMerged dataframe\n")
print (join_frame)

Merged dataframe

  SectionId  Subjects Semester ClassId Students
0       Id1     Maths    First     NaN      NaN
1       Id2   Science   Second     NaN      NaN
2       Id3  Computer    First     NaN      NaN
3       Id4   History    Third     NaN      NaN

In [31]:
join_frame= df_subject.set_index('SectionId').join(df_students.set_index('ClassId'), how='outer')

In [32]:
join_frame

     Subjects Semester Students
Id1     Maths    First   Trevor
Id2   Science   Second    Chris
Id3  Computer    First      NaN
Id4   History    Third     John
Id6       NaN      NaN    David

In [33]:
join_frame= df_subject.set_index('SectionId').join(df_students.set_index('ClassId'), how='inner')

In [34]:
join_frame

    Subjects Semester Students
Id1    Maths    First   Trevor
Id2  Science   Second    Chris
Id4  History    Third     John

In [37]:
df_m = df1_cars.join(df2_cars,lsuffix='sdf',rsuffix='rss')
df_m

    namesdf colorsdf yearsdf namerss colorrss yearrss
0     lexus      red    2012   lexus      red    2013
1   ferrari    white    2014     bmw    white    2015
2  mercedez    black    2015     NaN      NaN     NaN

In [38]:
df1_cars

       name  color  year
0     lexus    red  2012
1   ferrari  white  2014
2  mercedez  black  2015

In [39]:
df2_cars

       name  color  year
0     lexus    red  2013
1       bmw  white  2015
3  mercedez   blue  2016